Repository: pingfangx/TranslatorX
Catalog: JetBrains/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Selected region contained block {0, choice, 1#comment|2#comments}, surrounding ranges were commented.
zh_cn: 选中区域包含块注释， 包围的范围被注释。

source: Selected region contains block comment suffix
zh_cn: 选中区域包含块注释后缀

source: Selected region intersects existing comment
zh_cn: 选中区域与现有注释相交

source: Selected scope contain no Java classes
zh_cn: 选定范围不包含 Java 类

source: Selected templates:
zh_cn: 所选模板：

source: Selected text
zh_cn: 所选文本

source: Selected {0} directories
zh_cn: 选定的 {0} 目录

source: Selected {0} files
zh_cn: 选定的 {0} 个文件

source: Selected {0} is located in the read-only part of injected language document
zh_cn: 选定的 {0} 位于注入语言文档的只读部分

source: Selected {0} is not located inside the project
zh_cn: 所选的 {0} 不位于项目中

source: Selection
zh_cn: 所选部分

source: Selection does not form a fragment for extraction
zh_cn: 要导出的选择未形成片段

source: Selection from Editor
zh_cn: 从编辑器选择

source: Selection from {0}
zh_cn: 从 {0} 选择

source: Semantic highlighting
zh_cn: 语义高亮

source: Semantic highlighting:
zh_cn: 语义高亮：

source: Send To New Favorites List
zh_cn: 发送到新收藏列表

source: Send to Left
zh_cn: 发送到左边

source: Send to Right
zh_cn: 发送到右边

source: Sending failed.
zh_cn: 发送失败。

source: Separate index per letter
zh_cn: 每个字母分隔索引

source: Serializable classes and their serialization implementation
zh_cn: 可序列化的类及其序列化实现

source: Serialization issues
zh_cn: 序列化问题

source: Service interface provided but not exported or used
zh_cn: 提供服务接口但未导出或使用

source: Set &active
zh_cn: 设置为活动(&A)

source: Set Active Changelist
zh_cn: 设置活动更改列表

source: Set As Root
zh_cn: 设为根

source: Set Property Value
zh_cn: 设置属性值

source: Set Value
zh_cn: 设置值

source: Set Value...
zh_cn: 设置值...

source: Set as Global
zh_cn: 设置为全局

source: Set as IDE default
zh_cn: 设置为 IDE 默认

source: Set as project default
zh_cn: 设置为项目默认

source: Set changelist to which new changes are placed by default
zh_cn: 设置默认情况下新的更改放置的更改列表

source: Set class name first
zh_cn: 先设置类名

source: Set height value to {0}
zh_cn: 设置高度值为 {0}

source: Set language level
zh_cn: 设置语言级别

source: Set language level to {0}
zh_cn: 设置语言级别为 {0}

source: Set multiple cursors by adding all occurrences of the current word to the selection.
zh_cn: 通过将当前单词的所有匹配项添加到选择，来设置多个光标。

source: Set multiple cursors by adding the next occurrence of the current word to the selection.
zh_cn: 通过将当前单词的下一个匹配项添加到选择，来设置多个光标。

source: Set multiple cursors in the current file to edit multiple lines of code simultaneously.
zh_cn: 在当前文件中设置多个光标，以同时编辑多行代码。

source: Set package name to ''{0}''
zh_cn: 将包名设置为 ''{0}''

source: Set this path only for the current project
zh_cn: 仅为当前项目设置此路径

source: Set up HTTP proxy settings
zh_cn: 设置 HTTP 代理

source: Set up created SDK on project?
zh_cn: 在项目中设置创建的 SDK？

source: Set up {0, choice, 1#Module|2#Project} SDK
zh_cn: 设置 {0, choice, 1#模块|2#项目} SDK

source: Set width value to {0}
zh_cn: 设置宽度值为 {0}

source: SetUp Method
zh_cn: SetUp 方法

source: Sets greater value to a variable
zh_cn: 为变量设置更大的值

source: Sets lesser value to a variable
zh_cn: 为变量设置较小的值

source: Setter method found for the field {0}.
zh_cn: 找到字段 {0} 的 setter 方法。

source: Setter parameter for @{0} field is annotated @{1}
zh_cn: @{0} 字段的 setter 参数注解为 @{1}

source: Setter parameter for @{0} field might be annotated @{0} itself
zh_cn: @{0} 字段的 setter 参数可能被注解为 @{0}

source: Setting emulated method breakpoints
zh_cn: 设置模拟方法断点

source: Setting value...
zh_cn: 设置值...

source: Settings
zh_cn: 设置

source: Settings Actions
zh_cn: 设置操作

source: Settings Import
zh_cn: 导入设置

source: Settings Import Failed
zh_cn: 设置导入失败

source: Settings imported successfully.
zh_cn: 设置导入成功。

source: Settings...
zh_cn: 设置...

source: Setup JDK
zh_cn: 设置 JDK

source: Setup JDK Location
zh_cn: 设置 JDK 位置

source: Setup Library
zh_cn: 设置库

source: Setup SDK
zh_cn: 设置 SDK

source: Several files selected.
zh_cn: 选择了几个文件。

source: Several plugins depend on {0}.
zh_cn: 几个插件依赖于 {0}。

source: Severities Editor
zh_cn: 严重性编辑器

source: Severity by Scope
zh_cn: 范围严重性

source: Sh&orten fully qualified names
zh_cn: 缩短完全限定名称(&O)

source: Sh_ow Indent Guides
zh_cn: 显示缩进向导(_O)

source: Sh_ow Whitespaces
zh_cn: 显示空格(_O)

source: Share Anonymous Statistics
zh_cn: 分享匿名统计

source: Share scope
zh_cn: 共享范围

source: Shared
zh_cn: 共享

source: Shared &memory
zh_cn: 共享内存(&M)

source: Shared Scheme
zh_cn: 共享方案

source: Shared Scopes
zh_cn: 共享范围

source: Shared memory
zh_cn: 共享内存

source: Shared memory address unspecified
zh_cn: 未指定共享内存地址

source: Shared memory address:
zh_cn: 共享内存地址:

source: Shared scheme cannot be modified.
zh_cn: 共享方案不能被修改。

source: Shelve Changes
zh_cn: 搁置更改

source: Shelve Changes...
zh_cn: 搁置更改...

source: Shelve base revisions of files under distributed version control systems
zh_cn: 在分布式版本控制系统下搁置文件的基本修订

source: Shelved Version
zh_cn: 搁置版本

source: Shelved version
zh_cn: 搁置版本

source: Shelving Changes...
zh_cn: 搁置更改中...

source: Shift operators (<<, >>, >>>)
zh_cn: 移位运算符 (<<, >>, >>>)

source: Sho_w Source
zh_cn: 显示源码(_W)

source: Short element prefix:
zh_cn: 短元素前缀:

source: Shortc&uts
zh_cn: 快捷键(&U)

source: Shortcut Preview
zh_cn: 快捷键预览

source: Shortcut Promoter
zh_cn: 快捷方式启动

source: Shortcuts
zh_cn: 快捷键

source: Shorten &FQ names
zh_cn: 缩短 FQ 名称(&F)

source: Shorten command &line:
zh_cn: 短的命令行：(&L)

source: Should be cast to ''{0}''
zh_cn: 应该转换为 ''{0}''

source: Should be cast to ''{0}'' or its superclass
zh_cn: 应该转换为 ''{0}'' 或它的超类

source: Should be overridden in the ''{1}''.
zh_cn: 应该在 ''{1}'' 中被重写。

source: Should not be called
zh_cn: 不应该被 called

source: Should those be installed as well?
zh_cn: 那些还应该安装吗？

source: Show
zh_cn: 显示

source: Show "&Clear Read-only Status" Dialog
zh_cn: 显示 "清楚只读状态" 对话框(&C)

source: Show "close" button on editor tabs
zh_cn: 显示编辑器选项卡中的 "关闭" 按钮

source: Show &debug window on breakpoint
zh_cn: 在断点时显示调试窗口(&D)

source: Show &inherited methods
zh_cn: 显示继承的方法(&I)

source: Show &line number
zh_cn: 显示行号(&L)

source: Show &line numbers
zh_cn: 显示行号(&L)

source: Show &maximum
zh_cn: 显示最大值(&M)

source: Show Activities
zh_cn: 展示活动

source: Show All
zh_cn: 显示全部

source: Show All Affected Files
zh_cn: 显示所有受影响的文件

source: Show All Changes
zh_cn: 显示所有更改

source: Show All Messages
zh_cn: 显示所有消息

source: Show All TODO Items
zh_cn: 显示全部 TODO 项目

source: Show Ant build file properties dialog
zh_cn: 显示 Ant 构建文件属性对话框

source: Show Breadcrumbs
zh_cn: 显示面包屑导航

source: Show Breakpoints Dialog
zh_cn: 显示断点对话框

source: Show Changes
zh_cn: 显示更改

source: Show Classes
zh_cn: 显示类

source: Show Co&verage Info
zh_cn: 显录覆盖率信息(&V)

source: Show Code Co_verage Data
zh_cn: 显示代码覆盖率数据(_V)

source: Show Configurations
zh_cn: 显示配置

source: Show Console Prompt
zh_cn: 显示控制台提示

source: Show Context Menu
zh_cn: 显示上下文菜单

source: Show Details
zh_cn: 显示详细

source: Show Diff
zh_cn: 显示差异

source: Show Diff with Local
zh_cn: 显示与本地的差异

source: Show Difference
zh_cn: 显示差异

source: Show Differences
zh_cn: 显示差异

source: Show E_xecution Point
zh_cn: 显示执行点(_X)

source: Show Edge Labels
zh_cn: 显示边标签

source: Show Excluded Files
zh_cn: 显示排除文件

source: Show Fi_le View
zh_cn: 显示文件视图(_L)

source: Show Fields
zh_cn: 显示字段

source: Show Files
zh_cn: 显示文件

source: Show Filter Popup
zh_cn: 显示过滤弹框

source: Show Frame
zh_cn: 显示帧

source: Show Grid
zh_cn: 显示网格

source: Show Gutter Ic_ons
zh_cn: 显示 Gutter 图标(_O)

source: Show Help
zh_cn: 显示帮助

source: Show Hidden Files and Directories
zh_cn: 显示隐藏的文件和目录

source: Show Hidden Tabs
zh_cn: 显示隐藏的选项卡

source: Show History _for Selection
zh_cn: 显示选中历史(_F)

source: Show History _for {0}
zh_cn: 显示 {0} 的历史(_F)

source: Show History for Selection
zh_cn: 显示选中历史

source: Show History for _Revision
zh_cn: 显示修订历史(_R)

source: Show Ignored Files
zh_cn: 显示忽略的文件

source: Show Illegals Only
zh_cn: 只显示非法

source: Show Image Thumbnails
zh_cn: 显示缩略图

source: Show Import Popups
zh_cn: 显示导入弹窗

source: Show Included Only
zh_cn: 仅显示包含

source: Show Indent Guides
zh_cn: 显示缩进向导

source: Show Inherited
zh_cn: 显示继承

source: Show Intention Actions
zh_cn: 显示意向动作

source: Show L_ine Numbers
zh_cn: 显示行号(_I)

source: Show Libraries Contents
zh_cn: 显示库内容

source: Show Line Numbers
zh_cn: 显示行号

source: Show List of Tabs
zh_cn: 显示选项卡列表

source: Show Local VCS Statistics...
zh_cn: 显示本地 VCS 统计...

source: Show Local VCS statistics
zh_cn: 显示本地 VCS 统计

source: Show Main Menu
zh_cn: 显示主菜单

source: Show Members
zh_cn: 显示成员

source: Show Method Return Values
zh_cn: 显示方法返回值

source: Show Module Groups
zh_cn: 显示模块组

source: Show Modules
zh_cn: 显示模块

source: Show Passed
zh_cn: 显示已通过的

source: Show Properties
zh_cn: 显示属性

source: Show Recent Changes
zh_cn: 显示最近的更改

source: Show Referring Objects...
zh_cn: 显示引用对象...

source: Show Reformat File Dialog
zh_cn: 显示重新格式化文件对话框

source: Show Running List
zh_cn: 显示运行列表

source: Show Settings
zh_cn: 显示设置

source: Show Siblings
zh_cn: 显示同级

source: Show Source
zh_cn: 显示源码

source: Show Structure
zh_cn: 显示结构

source: Show Tips on Startup
zh_cn: 启动时显示提示

source: Show Values Inline
zh_cn: 显示值内联

source: Show Watches
zh_cn: 显示观察点

source: Show Welcome screen
zh_cn: 显示欢迎屏幕

source: Show _History
zh_cn: 显示历史(_H)

source: Show _Log in File Manager
zh_cn: 在文件管理器中显示日志(_L)

source: Show a popup window with documentation for the symbol at caret
zh_cn: 为插入符号处的符号弹窗显示一个文档

source: Show a popup window with the symbol (and its implementations) content
zh_cn: 显示一个弹出窗口显示符号(以及它的实现)的内容

source: Show a popup window with the symbol siblings content
zh_cn: 显示一个弹出窗口显示符号的同级内容

source: Show a popup with the list of toolwindow tabs
zh_cn: 显示一个包含工具窗口选项卡列表的弹出窗口

source: Show after ({0})
zh_cn: 显示在({0})之后

source: Show after...
zh_cn: 显示在...之后...

source: Show all changes made in the chosen revision
zh_cn: 显示选中修订中所做的所有更改

source: Show all messages produces by ant build
zh_cn: 显示由 Ant 构建产生的所有的消息

source: Show alternative source switcher
zh_cn: 显示可选资源切换器

source: Show as Tree
zh_cn: 显示为树

source: Show available debugger session values inside editor
zh_cn: 在编辑器中显示可用的调试器会话值

source: Show background tasks window on starting of any progress
zh_cn: 启动任何进程时显示后台任务窗口

source: Show before ({0})
zh_cn: 显示在({0})之前

source: Show before...
zh_cn: 显示在...之前...

source: Show breadcrumbs
zh_cn: 显示面包屑导航

source: Show call hierarchy for selected method
zh_cn: 显示选中方法的调用层次结构

source: Show changes
zh_cn: 显示更改

source: Show class name
zh_cn: 显示类名

source: Show code folding outline
zh_cn: 显示代码折叠大纲

source: Show code lens on scrollbar hover
zh_cn: 在滚动条上悬停时显示代码镜头

source: Show columns
zh_cn: 显示列

source: Show commit message history
zh_cn: 显示提交信息的历史

source: Show console when a message is printed to standard error stream
zh_cn: 当消息打印到标准错误流时显示控制台

source: Show console when a message is printed to standard output stream
zh_cn: 当消息打印到标准输出流时显示控制台

source: Show context help
zh_cn: 显示上下文帮助

source: Show dependencies between modules in project
zh_cn: 显示项目中的模块之间的依赖关系

source: Show description of error or warning at caret
zh_cn: 显示插入符号处的错误或警告说明

source: Show dialog for configuring gutter icons
zh_cn: 显示对话框以配置 gutter 图标

source: Show diff
zh_cn: 显示差异

source: Show diff anyway?
zh_cn: 仍显示差异?

source: Show diff for selected change
zh_cn: 显示选中更改的差异

source: Show diff only
zh_cn: 只显示差异

source: Show diff with version before update
zh_cn: 显示与更新前版本的差异

source: Show documentation
zh_cn: 显示文档

source: Show dropdown with the list of tabs that don't fit on the screen in single-row tab layout
zh_cn: 使用下拉列表来展示在单行的选项卡布局中容纳不下的选项卡。

source: Show expert properties
zh_cn: 显示 expert 属性

source: Show external annotations inline
zh_cn: 内联显示外部注释

source: Show full documentation in a pinned window
zh_cn: 在一个固定窗口显示完整文档

source: Show full signatures
zh_cn: 显示完整的签名

source: Show gutter &icons
zh_cn: 显示 Gutter 图标(&I)

source: Show hard wrap guide (configured in Code Style options)
zh_cn: 显示硬换行指南(在代码样式选项中配置)

source: Show help contents
zh_cn: 显示帮助内容

source: Show hex value for primitives
zh_cn: 为原值显示十六进制值

source: Show hidden files and directories
zh_cn: 显示隐藏的文件和目录

source: Show hierarchy for method of selected class/interface
zh_cn: 显示选中类/接口的方法的层次结构

source: Show history
zh_cn: 显示历史

source: Show history for editor selection
zh_cn: 显示编辑器选中历史

source: Show history for selected file revision
zh_cn: 显示选中文件的修订历史

source: Show history of file
zh_cn: 显示文件历史

source: Show icons in quick navigation
zh_cn: 在快速导航中显示图标

source: Show icons preview in gutter for small icons (Java)
zh_cn: 在 gutter 显示小图标的图标预览(Java)

source: Show ignored files
zh_cn: 显示忽略的文件

source: Show import &popup
zh_cn: 显示导入的弹出窗口(&P)

source: Show import statements
zh_cn: 显示导入语句

source: Show in
zh_cn: 显示在

source: Show inferred annotations inline
zh_cn: 内嵌显示推断的注释

source: Show information about last modification date and author for each line
zh_cn: 显示每行的最后修改日期和作者信息

source: Show information about the IDE
zh_cn: 显示有关 IDE 的信息

source: Show inspections new in IDEA 9
zh_cn: 显示在 IDEA 9中检查到的新特性

source: Show line numbers
zh_cn: 显示行号

source: Show list of Run Configurations running at the moment
zh_cn: 显示当前运行的运行配置列表

source: Show list of all bookmarks
zh_cn: 显示全部书签列表

source: Show list of recently changed files
zh_cn: 显示最近更改的文件列表

source: Show list of recently viewed files
zh_cn: 显示最近查看的文件列表

source: Show memory indicator
zh_cn: 显示内存指示

source: Show merge sources
zh_cn: 显示合并源码

source: Show method arguments types
zh_cn: 显示方法参数类型

source: Show method separators
zh_cn: 显示方法分隔符

source: Show modules in a flat list
zh_cn: 在平面列表中显示模块

source: Show non-public
zh_cn: 显示非公用

source: Show online documentation
zh_cn: 显示在线文档

source: Show only files included to the current scope selected
zh_cn: 仅显示包含在当前选定范围内的文件

source: Show only files that have illegal dependencies
zh_cn: 只显示文件非法依赖

source: Show only monospaced fonts
zh_cn: 只显示等宽字体

source: Show only variables used near the execution point
zh_cn: 只显示在执行点附近使用的变量

source: Show package name
zh_cn: 显示包名

source: Show panel to configure highlighting mode for the current file
zh_cn: 对当前文件显示面板配置高亮模式

source: Show parameter name hints
zh_cn: 显示参数名提示

source: Show parameter name hints on completion
zh_cn: 补全时显示参数名提示

source: Show parameters of the method call at caret
zh_cn: 显示插入符号处的方法的参数

source: Show passed tests
zh_cn: 显示通过的测试

source: Show path
zh_cn: 显示路径

source: Show popup for currently selected change
zh_cn: 当前选择的更改弹窗

source: Show popup list of live templates starting with the specified prefix
zh_cn: 弹出以指定前缀开头的代码模板列表

source: Show productivity features usages statistics
zh_cn: 显示生产力功能使用统计

source: Show productivity hints during startup or other lengthy processes
zh_cn: 在启动或较长进程时显示生产力指南

source: Show productivity hints while compiling
zh_cn: 在编译时显示生产率提示

source: Show quick doc on mouse over element (ms):
zh_cn: 在鼠标放在元素上时显示快速文档(毫秒):

source: Show read access
zh_cn: 显示读访问

source: Show right margin (configured in Code Style options)
zh_cn: 显示右边距(代码样式选项中配置)

source: Show selected item as left diff version
zh_cn: 将所选项目显示为左侧差异版本

source: Show selected item as right diff version
zh_cn: 将所选项目显示为右侧差异版本

source: Show selected nodes with dependencies
zh_cn: 显示选中节点的依赖

source: Show signatures
zh_cn: 显示签名

source: Show soft wrap indicators for current line only
zh_cn: 仅显示当前行的自动换行指示器

source: Show source file name
zh_cn: 显示源文件名

source: Show stack &frames for synthetic methods
zh_cn: 为 synthetic 方法显示堆栈桢(&F)

source: Show static members after instance qualifier
zh_cn: 实例修饰符后显示静态成员

source: Show structure view
zh_cn: 显示结构视图

source: Show tabs in single row
zh_cn: 选项卡单行显示

source: Show tabs tooltips
zh_cn: 显示标签工具提示

source: Show the breadcrumbs bar above the text editor
zh_cn: 在文本编辑器顶部显示面包屑导航栏

source: Show the breadcrumbs bar below the text editor
zh_cn: 在文本编辑器底部显示面包屑导航栏

source: Show the current method or class declaration when it is not visible
zh_cn: 显示当前方法或类声明，当它不可见时

source: Show the current program execution point
zh_cn: 显示当前程序执行点

source: Show the list of all breakpoints (&shortcut:ViewBreakpoints;), right-click the one you are interested in, and choose Move to Group on the context menu.
zh_cn: 显示所有断点列表(&shortcut:ViewBreakpoints;)，右键单击您感兴趣的断点，然后在上下文菜单中选择 Move to Group。

source: Show this page
zh_cn: 显示这个页面

source: Show thread &groups
zh_cn: 显示线程组(&G)

source: Show thumbnails view for current directory
zh_cn: 显示当前目录的缩略图视图

source: Show tips on startup
zh_cn: 启动时显示提示

source: Show tool window bars
zh_cn: 显示工具窗口栏

source: Show tool window numbers
zh_cn: 显示工具窗口号

source: Show type and object id
zh_cn: 显示类型和对象 id

source: Show type for strings
zh_cn: 显示字符串的类型

source: Show type of the selected expression
zh_cn: 显示选中表达式的类型

source: Show usages
zh_cn: 显示用法

source: Show usages of the symbol at caret
zh_cn: 显示插入符号处符号的使用

source: Show value on selection change
zh_cn: 当所选值更改时显示值

source: Show value tooltip on code selection
zh_cn: 选中代码时显示值提示

source: Show value tooltip.
zh_cn: 显示值提示。

source: Show values inline
zh_cn: 显示值内联

source: Show version control related information for all local files
zh_cn: 显示全部本地文件的版本控制信息

source: Show virtual space at file bottom
zh_cn: 显示文件底部的虚拟空白

source: Show watches in variables tab
zh_cn: 在变量选项卡中显示观察点

source: Show whitespaces
zh_cn: 显示空白符

source: Show write access
zh_cn: 显示写访问

source: Show/Compact Empty Middle Packages
zh_cn: 显示/压缩空的中间包

source: Show/Hide Applied Shelved Changes
zh_cn: 显示/隐藏已应用的搁置更改

source: Show/Hide Empty Middle Packages
zh_cn: 显示/隐藏空的中间包

source: Show/Hide Excluded Files
zh_cn: 显示/隐藏排除的文件

source: Show/Hide Files
zh_cn: 显示/隐藏文件

source: Show/Hide Library Contents
zh_cn: 显示/隐藏库内容

source: Show/Hide Library Frames
zh_cn: 显示/隐藏库框架

source: Show/Hide Members
zh_cn: 显示/隐藏成员

source: Show/Hide Modules
zh_cn: 显示/隐藏模块

source: Show/Hide background tasks window
zh_cn: 显示/隐藏后台任务窗口

source: Show/Hide path text
zh_cn: 显示/隐藏路径文本

source: Show/Hide path text field
zh_cn: 显示/隐藏路径文本字段

source: Show/hide the main toolbar
zh_cn: 显示/隐藏主工具栏

source: Show/hide the navigation bar
zh_cn: 显示/隐藏导航栏

source: Show/hide the status bar
zh_cn: 显示/隐藏状态栏

source: Show/hide tool window buttons
zh_cn: 显示/隐藏工具窗口按钮

source: Shows or hides 'watches' pane
zh_cn: 显示或隐藏 '观察点' 面板

source: Shrink Selection
zh_cn: 缩小选择

source: Shut_down
zh_cn: 关掉(_D)

source: Shutdown
zh_cn: 关掉

source: Shutdown {1}?
zh_cn: 关机 {1}？

source: Side Effects Found
zh_cn: 发现副作用

source: Side-by-side layout on the left
zh_cn: 左边并排布局

source: Side-by-side layout on the right
zh_cn: 右侧并排布局

source: Sign: brace, comma, etc
zh_cn: 符号：括号、逗号等

source: Signature Preview
zh_cn: 签名预览

source: Signature is different
zh_cn: 签名是不同的

source: Signature preview
zh_cn: 签名预览

source: Silent Code Cleanup
zh_cn: 静默代码清理

source: Simple blocks in one line
zh_cn: 简单的块在同一行

source: Simple classes in one line
zh_cn: 简单的类在同一行

source: Simple content types detection (leaf text)
zh_cn: 简单的内容类型检测(叶文本)

source: Simple lambdas in one line
zh_cn: 简单的 lambdas 表达式在一行

source: Simple methods in one line
zh_cn: 简单的方法在同一行

source: Simplify ''{0}'' to {1}
zh_cn: 简化 ''{0}'' 为 {1}

source: Simplify Boolean Expression
zh_cn: 简化布尔表达式

source: Simplify boolean expression
zh_cn: 简化布尔表达式

source: Simplify cascaded collector
zh_cn: 简化 cascaded collector

source: Simplify to normal assignment
zh_cn: 简化为正常赋值

source: Since:
zh_cn: 自:

source: Single &instance only
zh_cn: 单一实例(&I)

source: Single Click
zh_cn: 单击

source: Size:
zh_cn: 大小:

source: Ski&p synthetic methods
zh_cn: 跳过 synthetic 方法(&P)

source: Skip
zh_cn: 跳过

source: Skip &constructors
zh_cn: 跳过构造器(&C)

source: Skip Content
zh_cn: 跳过内容

source: Skip To &Next File
zh_cn: 跳到下一文件(&N)

source: Skip class l&oaders
zh_cn: 跳过类加载器(&O)

source: Skip if defined
zh_cn: 如果已定义则跳过

source: Skip import statements
zh_cn: 跳过导入语句

source: Skip simple &getters
zh_cn: 跳过简单 getter 方法(&G)

source: Skipped
zh_cn: 跳过的

source: Skipped breakpoint at {0} because it happened inside debugger evaluation
zh_cn: 在 {0} 跳过断点因为其发生于调试器计算内部

source: Skipping page {1} of {2}
zh_cn: 跳过页 {1} / {2}

source: Slider or Ctrl+Wheel change font size
zh_cn: 用滑块或 Ctrl+滚轮 更改字体大小

source: Slow Inspections
zh_cn: 慢速检查

source: Smart Enter:
zh_cn: 智能回车:

source: Smart Keys
zh_cn: 智能 Keys

source: Smart Ste_p Into
zh_cn: 智能步入(_P)

source: Smart Type Completion
zh_cn: 智能类型补全

source: Smart indent
zh_cn: 智能缩进

source: Smart tabs
zh_cn: 智能 tab

source: Smart type c&ompletion
zh_cn: 智能类型补全(&O)

source: Smart type casting
zh_cn: 智能类型转换

source: Smart type completion
zh_cn: 智能类型补全

source: Smart type completion after new
zh_cn: 在 new 后的智能类型补全

source: Smooth scrolling
zh_cn: 平滑滚动

source: Snap To Grid
zh_cn: 对齐网格

source: So doing, &productName; pinpoints the top five most suitable results and highlights them on the blue background.
zh_cn: 这样做的话， &productName; 会确定前五个最适合的结果，并将它们突出显示在蓝色背景上。

source: So doing, IntelliJ IDEA pinpoints the top five most suitable results and highlights them on the blue background.
zh_cn: 这样做的话， &productName; 会确定前五个最适合的结果，并将它们突出显示在蓝色背景上。

source: So doing, if a class has more than one constructor, the links are shown:
zh_cn: 这样做，如果一个类有多个构造函数，则会显示以下链接：

source: So doing, if you just click the desired browser icon, the file shows up in the built-in server port; however, when you keep the Shift key pressed while clicking the browser icon, the file runs immediately from its location.
zh_cn: 这样做，如果你只是点击所需的浏览器图标，该文件显示在内置的服务器端口; 但是，如果在按住 Shift 键的同时单击浏览器图标，文件将立即从其位置运行。

source: Soft Wraps
zh_cn: 自动换行

source: Soft wraps were forcibly enabled to improve editor performance.
zh_cn: 自动换行被强制启用，以提高编辑器的性能。

source: Soft-Wrap All Files
zh_cn: 自动换行所有文件

source: Soft-Wrap Current File
zh_cn: 自动换行当前文件

source: Some classes have been changed.
zh_cn: 有些类已经改变了。

source: Some files are changed on server
zh_cn: 某些文件在服务器上已更改

source: Some files contain problems.
zh_cn: 某些文件包含问题。

source: Some files were locally modified.
zh_cn: 有些文件已在本地修改过。

source: Some folders are locked; VCS operations are not allowed for them.
zh_cn: 某些文件夹被锁定; 他们不允许进行 VCS 操作。

source: Some modules has circular dependency.
zh_cn: 一些模块存在循环依赖。

source: Some modules have cyclic dependencies.
zh_cn: 某些模块具有循环依赖性。

source: Some of the changes in the specified patch were skipped because they are already contained in the code
zh_cn: 指定补丁中的某些更改已被跳过，因为它们已经包含在代码中

source: Some required library wasn't downloaded.
zh_cn: 某些必需的库未被下载。

source: Sort Alphabetically
zh_cn: 按字母顺序排序

source: Sort Bookmarks by Mnemonic, File and Line
zh_cn: 通过助记符，文件和行排序书签

source: Sort By Duration
zh_cn: 按时间排序

source: Sort Configurations
zh_cn: 排序配置

source: Sort Members Alphabetically
zh_cn: 按字母顺序排序成员

source: Sort Values Alphabetically
zh_cn: 按字母顺序排序值

source: Sort a&lphabetically
zh_cn: 按字母顺序排序(&L)

source: Sort by Type
zh_cn: 按类型

source: Sort by Visibility
zh_cn: 按可见度排序

source: Sort configurations alphabetically
zh_cn: 按字母顺序排序配置

source: Sort tests or suites alphabetically
zh_cn: 按字母顺序排序测试或程序组

source: Sort tests or suites by duration
zh_cn: 按时间排序测试或程序组

source: Sort values a&lphabetically
zh_cn: 按字幕顺序排序值(&L)

source: Sort values alphabetically in debugger views
zh_cn: 在调试器视图中按字母顺序排序值

source: Source Folders
zh_cn: 源文件夹

source: Source and destination classes should be different
zh_cn: 源和目标类应该不同

source: Source code does not match the bytecode
zh_cn: 源代码与字节码不匹配

source: Source directory should be under module content root directory
zh_cn: 源目录应该在模块内容根目录下

source: Source file changed or found source file does not correspond to the breakpoint''s file
zh_cn: 源文件已更改或找到的源文件与断点的文件不对应

source: Source files for your module have been found.
zh_cn: 已找到您的模块的源文件。

source: Source files for your project have been found.
zh_cn: 找到您的项目的源文件。

source: Source files for your project not found.
zh_cn: 找不到您的项目的源文件。

source: Source folder {0} has package prefix ''{1}'' Package ''{2}'' cannot be created there.
zh_cn: 源文件夹 {0} 有包前缀 ''{1}'' 包 ''{2}'' 无法在那里创建。

source: Source root "{0}" cannot be defined in module "{1}" because it belongs to content of nested module "{2}"
zh_cn: 源码根目录 "{0}" 不能在模块 "{1}" 中定义，因为它属于嵌套模块 "{2}" 的内容

source: Source root "{0}" is duplicated in module "{1}".
zh_cn: 源码根目录 "{0}" 在模块 "{1}" 中重复。

source: Sourcepath
zh_cn: 源码路径

source: Sources
zh_cn: 源码
